Repository: ioi-germany/cms
Catalog: cms/server/po/*.po
Languages: fr

source: Compilation succeeded
fr: Compilation réussie

source: Compilation failed
fr: Erreur de compilation

source: Compilation timed out
fr: Durée maximale de compilation dépassée

source: Compilation killed with signal %d (could be triggered by violating memory limits)
fr: Compilation interrompue : signal %d (peut provenir d'un débordement de mémoire)

source: Execution timed out
fr: Durée maximale d'exécution dépassée

source: Execution killed with signal %d (could be triggered by violating memory limits)
fr: Exécution interrompue : signal %d (peut provenir d'un débordement de mémoire)

source: Execution killed because of forbidden syscall %s
fr: Exécution interrompue : utilisation interdite de l'appel système %s

source: Execution killed because of forbidden file access
fr: Exécution interrompue : accès à un fichier (interdit)

source: Execution failed because the return code was nonzero
fr: Exécution échouée: code de retour différent de zéro

source: Output is correct
fr: Sortie correcte

source: Output isn't correct
fr: Sortie incorrecte

source: Evaluation didn't produce file %s
fr: L'exécution n'a pas produit de fichier %s

source: Subtask %d
fr: Sous-tâche %d

source: Outcome
fr: Résultat

source: Details
fr: Détails

source: Execution time
fr: Durée d'exécution

source: Memory used
fr: Mémoire utilisée

source: Not correct
fr: Incorrect

source: Partially correct
fr: Partiellement correct

source: Invalid files in submission
fr: Fichiers soumis incorrects

source: No compilation needed
fr: Compilation non nécessaire

source: File not submitted
fr: Aucun fichier soumis

source: Question received
fr: Question envoyée

source: Your question has been received, you will be notified when the it will be answered.
fr: Votre question a été envoyée, vous serez notifié lorsque quelqu'un y aura répondu.

source: You have reached the maximum limit of at most %d submissions among all tasks.
fr: Vous avez atteint le nombre maximum de %d soumissions toutes tâches confondues.

source: You have reached the maximum limit of at most %d submissions on this task.
fr: Vous avez atteint le nombre maximum de %d soumissions pour cette tâche.

source: Too many submissions!
fr: Trop de soumissions !

source: Among all tasks, you can submit again after %d seconds from last submission.
fr: Toutes tâches confondues, vous ne pouvez resoumettre que %d secondes après votre précédente soumission.

source: For this task, you can submit again after %d seconds from last submission.
fr: Pour cette tâche, vous ne pouvez resoumettre que %d secondes après votre précédente soumission.

source: Submissions too frequent!
fr: Soumissions trop rapprochées !

source: Invalid submission format!
fr: Format de soumission invalide !

source: Please select the correct files.
fr: Sélectionnez les fichiers corrects.

source: Invalid archive format!
fr: Format d'archive invalide !

source: The submitted archive could not be opened.
fr: Impossible d'ouvrir l'archive soumise.

source: Cannot recognize submission's language.
fr: Impossible de reconnaître le language du fichier soumis.

source: All sources must be in the same language.
fr: Toutes les fichiers sources doivent être dans le même. language

source: Invalid submission!
fr: Soumission invalide !

source: Submission too big!
fr: Fichier soumis trop gros !

source: Each source file must be at most %d bytes long.
fr: Chaque fichier source ne peut pas faire plus de %d octets.

source: Submission storage failed!
fr: Erreur d'enregistrement de votre soumission !

source: Please try again.
fr: Veuillez réessayer.

source: Submission received
fr: Soumission reçue

source: Your submission has been received and is currently being evaluated.
fr: Votre soumission a bien été reçue et est en cours d'évaluation.

source: Token request discarded
fr: Demande de token refusée

source: Your request has been discarded because you have no tokens available.
fr: Votre requête a été annulée car vous n'avez plus de jetons disponibles.

source: Your request has been discarded because you already used a token on that submission.
fr: Votre requête a été annulée car vous avez déjà utilisé un jeton sur cette soumission.

source: Token request received
fr: Demande de jeton reçue

source: Your request has been received and applied to the submission.
fr: Votre requête a été reçue et appliquée à la soumission.

source: Compiling...
fr: Compilation...

source: details
fr: détails

source: Evaluating...
fr: Evaluation...

source: Scoring...
fr: Calcul des points...

source: Evaluated
fr: Évalué

source: You have reached the maximum limit of at most %d tests among all tasks.
fr: Vous avez atteint le nombre maximal de %d tests toutes tâches confondues.

source: You have reached the maximum limit of at most %d tests on this task.
fr: Vous avez atteint le nombre maximal de %d tests pour cette tâche.

source: Too many tests!
fr: Trop de tests !

source: Among all tasks, you can test again after %d seconds from last test.
fr: Toutes tâches confondues, vous ne pouvez relancer un test que %d secondes après votre précédent test.

source: For this task, you can test again after %d seconds from last test.
fr: Pour cette tâche, vous ne pouvez relancer un test que %d secondes après votre précédent test.

source: Tests too frequent!
fr: Tests trop rapprochés !

source: Invalid test format!
fr: Format de test invalide !

source: Cannot recognize test's language.
fr: Impossible de reconnaître le language du test.

source: Invalid test!
fr: Test invalide !

source: Test too big!
fr: Test trop gros !

source: Input too big!
fr: Fichier d'entrée trop gros !

source: The input file must be at most %d bytes long.
fr: Le fichier d'entrée ne peut pas faire plus de %d octets.

source: Test storage failed!
fr: Impossible d'enregistrer le test !

source: Test received
fr: Test reçu

source: Your test has been received and is currently being executed.
fr: Votre test a été reçu et est en cours d'exécution.

source: %Y-%m-%d
fr: %d/%m/%Y

source: %Y-%m-%d %H:%M:%S
fr: %d/%m/%Y %H:%M:%S

source: %d second
fr: %s seconde

source: %d hour
fr: %d heure

source: %d day
fr: %d jour

source: %s and %s
fr: %s et %s

source: more than %s
fr: plus de %s

source: contest-token
fr: jeton d'épreuve

source: contest-tokens
fr: jetons d'épreuve

source: task-token
fr: jeton de tâche

source: task-tokens
fr: jetons de tâche

source: token
fr: jeton

source: tokens
fr: jetons

source: You don't have %(type_pl)s available for this task.
fr: Vous n'avez plus de %(type_pl)s disponibles pour cette tâche.

source: You have infinite %(type_pl)s.
fr: Vous avez une infinité de %(type_pl)s.

source: You can use a %(type_s)s every second.
fr: Vous pouvez utiliser un %(type_s)s chaque seconde.

source: You have no limitations on how you use them.
fr: Il n'y a pas de limitation sur leur utilisation.

source: You start with no %(type_pl)s.
fr: Vous commencez avec aucun %(type_s)s.

source: You start with one %(type_s)s.
fr: Vous commencez avec un %(type_s)s.

source: Every minute
fr: Chaque minute

source: you get another %(type_s)s,
fr: vous recevez un nouveau %(type_s)s,

source: up to a maximum of one %(type_s)s.
fr: jusqu'à un maximum d'un %(type_s)s.

source: you get another %(type_s)s.
fr: vous recevez un %(type_s)s supplémentaire.

source: You don't get other %(type_pl)s.
fr: Vous ne recevez plus de %(type_s)s.

source: You can use a %(type_s)s every second
fr: Vous pouvez utiliser un %(type_s)s par seconde

source: and no more than one %(type_s)s in total.
fr: et pas plus d'un %(type_s)s au total.

source: You can use no more than one %(type_s)s in total.
fr: Vous pouvez utiliser au maximum un %(type_s)s.

source: Logged in as <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>
fr: Connecté en tant que <strong>%(first_name)s %(last_name)s</strong> <em>(%(username)s)</em>

source: Logout
fr: Se déconnecter

source: Failed to log in.
fr: Connexion impossible

source: Welcome
fr: Bienvenue

source: Please log in
fr: Veuillez vous connecter

source: Username
fr: Nom d'utilisateur

source: Password
fr: Mot de passe

source: Login
fr: Se connecter

source: Reset
fr: Effacer

source: New message
fr: Nouveau message

source: New announcement
fr: Nouvelle annonce

source: New answer
fr: Nouvelle réponse

source: %d unread
fr: %d non lu(s)

source: Until contest starts:
fr: L'épreuve commence dans :

source: Until contest ends:
fr: Temps d'épreuve restant :

source: Time left:
fr: Temps restant :

source: Server time:
fr: Heure serveur :

source: Overview
fr: Présentation

source: Statement
fr: Énoncé

source: Submissions
fr: Soumissions

source: Testing
fr: Tests

source: is released under the
fr: est publié sous la

source: GNU Affero General Public License
fr: licence GNU Affero General Public

source: Announcements
fr: Annonces

source: (no subject)
fr: (aucun objet)

source: Subject
fr: Objet

source: Text
fr: Texte

source: Ask question
fr: Poser une question

source: no answer yet
fr: pas encore de réponse

source: Standard Template Library
fr: Librairie Standard C++ (STL)

source: Error %d
fr: Erreur %d

source: An error occured while the server was handling your request.
fr: Une erreur s'est produite lors du traitement de votre requête.

source: Note that attempts to tamper with Contest Management System (such as probing the server with customized URLs) may be considered cheating and may lead to disqualification.
fr: Toute tentative de manipulation frauduleuse du serveur de soumission (telle que manipuler les adresses du site) sera considéré comme de la triche et pourra mener à une disqualification.

source: If you encountered this error during normal usage, please notify the contest administrators.
fr: Si vous recontrer cette erreur alors que vous utilisez le service normalement, veuillez en notifier les administrateurs du concours.

source: General information
fr: Information générale

source: The contest hasn't started yet.
fr: L'épreuve n'a pas encore commencé.

source: The contest will start at %(start_time)s and will end at %(stop_time)s.
fr: Le concours commencera le %(start_time)s et se terminera le %(stop_time)s.

source: The contest is currently running.
fr: Le concours est en cours.

source: The contest started at %(start_time)s and will end at %(stop_time)s.
fr: Le concours a commencé le %(start_time)s et se terminera le %(stop_time)s.

source: The contest has already ended.
fr: L'épreuve est terminée.

source: The contest started at %(start_time)s and ended at %(stop_time)s.
fr: Le concours a commencé le %(start_time)s et s'est terminé le %(stop_time)s.

source: You have an infinite set of tokens.
fr: Vous avez un nombre infini de jetons.

source: You can use one of these tokens to see the detailed result of a submission.
fr: Vous pouvez utiliser l'un de ces jetons pour obtenir les résultats détaillés de votre soumission.

source: Your score for each task will be the maximum among the tokened submissions and the last one.
fr: Votre score pour chaque tâche sera le maximum entre les soumissions pour lesquelles vous aurez utilisé un jeton, et votre dernière soumission.

source: You can use at most one token every second among all tasks.
fr: Vous pouvez utiliser au plus un jeton par seconde toutes tâches confondues.

source: You can use at most one token every %(min_interval)d seconds among all tasks.
fr: Vous pouvez utiliser au plus un jeton toutes les %(min_interval)d secondes toutes tâches confondues.

source: Tasks may pose further limitations on how often you can use tokens.
fr: Chaque tâche peut définir des limitations supplémentaires en ce qui concerne l'utilisation de jetons.

source: See the description page of each task for more information.
fr: Consultez la description de chaque tâche pour plus d'informations.

source: Tasks may pose some limitations on how often you can use tokens.
fr: Chaque tâche peut définir certaines limitations sur le nombre de jetons maximum qui vous pouvez utiliser.

source: You have a distinct set of tokens for each task.
fr: Vous avez un nombre différent de jetons pour chaque tâche.

source: You can find the rules for the tokens on the description page of each task.
fr: Vous trouverez les règles d'attribution des jetons dans la description de chaque tâche.

source: In addition to those rules, you can use at most one token every second among all tasks.
fr: En plus de ces règles, vous pouvez utiliser, au plus, un jeton chaque seconde toutes tâches confondues.

source: In addition to those rules, you can use at most one token every %(min_interval)d seconds among all tasks.
fr: En plus de ces règles, vous pouvez utiliser, au plus, un jeton toutes les %(min_interval)d secondes toutes tâches confondues.

source: You have a set of tokens shared among all tasks.
fr: Vous avez un ensemble de jetons partagés entre toutes les tâches.

source: In addition to these rules, tasks may pose some limitations on how often you can use tokens.
fr: En plus de ces règles, chaque tâche peut définir certaines limitations sur le nombre de jetons que vous pouvez utiliser.

source: You have two types of tokens: a set of <em>contest-tokens</em> shared among all tasks and a distinct set of <em>task-tokens</em> for each task.
fr: Vous avez deux types de jetons : un ensemble de <em>jetons d'épreuve</em> partagés entre toutes les tâches, et un ensemble de <em>jetons de tâche</em> spécifique à chaque tâche.

source: You can see the detailed result of a submission by using two tokens on it, one of each type.
fr: Vous pouvez voir le résultat détaillé d'une soumission en utilisant deux jetons, un de chaque type.

source: You can find the rules for the task-tokens on each task's description page.
fr: Vous pouvez trouver les règles pour les jetons de tâche sur la description de chacun des tâches.

source: Every user is allowed to compete (i.e. submit solutions) for a uninterrupted time frame of %(per_user_time)s.
fr: Chaque utilisateur est autorisé à participer (c.-à.-d. soumettre des solutions) de façon ininterrompue durant %(per_user_time)s.

source: As soon as the contest starts you can choose to start your time frame.
fr: Dès que le concours a débuté, vous pouvez choisir la fourchette de temps pendant laquelle vous participez.

source: Once you start, you can submit solutions until the end of the time frame or until the end of the contest, whatever comes first.
fr: Lorsque vous avez commencé, vous pouvez soumettre jusqu'à ce que votre fourchette de participation soit terminée ou que le concours se termine (selon le premier ayant lieu)

source: By clicking on the button below you can start your time frame.
fr: En cliquant sur le bouton ci-dessous, vous commencerez votre fourchette de participation.

source: You started your time frame at %(start_time)s.
fr: Vous avez commencé votre fourchette de participation le %(start_time)s.

source: You can submit solutions until the end of the time frame or until the end of the contest, whatever comes first.
fr: Vous pouvez soumettre jusqu'à la fin de votre fourchette de participation ou jusqu'à la fin du concours (selon le premier qui aura lieu).

source: You started your time frame at %(start_time)s and you already finished it.
fr: Votre fourchette de participation a débuté le %(start_time)s et est maintenant terminée.

source: There's nothing you can do now.
fr: Il n'y a plus rien à faire pour l'instant.

source: You never started your time frame. Now it's too late.
fr: Vous n'avez pas démarré votre fenêtre de participantion. Il est maintenant trop tard.

source: Start!
fr: Commencer !

source: Task overview
fr: Résumé des tâches

source: Task
fr: Tâche

source: Name
fr: Nom

source: Time limit
fr: Limite de temps

source: Memory limit
fr: Limite de mémoire

source: Files
fr: Fichiers

source: Tokens
fr: Jetons

source: %(seconds)g second
fr: %(seconds)g seconde

source: %(seconds)g seconds
fr: %(seconds)g secondes

source: %(mb)d MiB
fr: %(mb)d Mio (MiB)

source: Yes
fr: Oui

source: No
fr: Non

source: Compilation output
fr: Résultat de la compilation

source: Compilation outcome:
fr: Résultat de la compilation :

source: Compilation time:
fr: Durée de la compilation :

source: Memory used:
fr: Mémoire utilisée :

source: Standard output
fr: Sortie standard

source: Standard error
fr: Sortie d'erreur

source: None
fr: Aucun(e)

source: Download
fr: Télécharger

source: Played
fr: Utilisé

source: Play!
fr: Utiliser !

source: Wait...
fr: Attendez...

source: No tokens
fr: Aucun jeton

source: no statement available
fr: aucun énoncé disponible

source: Download task statement
fr: Télécharger l'énoncé

source: The statement for this task is available in multiple versions, in different languages.
fr: L'énoncé pour cette tâche est disponible en plusieurs versions (plusieurs langues).

source: You can see (and download) all of them using the list on the right.
fr: Vous pouvez les voir toutes (et les télécharger) dans la liste sur la droite.

source: Some suggested translations follow.
fr: D'autres versions peuvent également être disponibles.

source: Statement in <b>%s</b>
fr: Énoncé en <b>%s</b>

source: Statement in %s
fr: Énoncé en %s

source: Some details
fr: Quelques détails

source: Compilation commands
fr: Commandes utilisées pour compiler

source: You can use at most one token every second for this task
fr: Vous pouvez utiliser au plus un jeton chaque seconde pour cette tâche

source: You can use at most one token every %(min_interval)d seconds for this task
fr: Vous pouvez utiliser au plus une jeton toutes les %(min_interval)d secondes pour cette tâche

source: and at most one token every second among all tasks.
fr: et au maximum un jeton par seconde pour l'ensemble des tâches.

source: and at most one token every %(min_interval)d seconds among all tasks.
fr: et au maximum un jeton chaque %(min_interval)d secondes pour l'ensemble des tâches.

source: You can use at most one token every second for this task.
fr: Vous pouvez utiliser au plus un jeton chaque seconde pour cette tâche.

source: You can use at most one token every %(min_interval)d seconds for this task.
fr: Vous pouvez utiliser au plus un jeton toutes les %(min_interval)d secondes pour cette tâche.

source: On this task you don't have additional rules.
fr: Il n'y a pas de règle supplémentaires pour cette tâche.

source: In addition to these rules, you can use at most one token every second among all tasks.
fr: En plus de ces règles, vous pouvez utiliser au plus un jeton chaque seconde toutes tâches confondues.

source: In addition to these rules, you can use at most one token every %(min_interval)d seconds among all tasks.
fr: En plus de ces règles, vous pouvez utiliser au plus un jeton toutes les %(min_interval)d secondes toutes tâches confondues.

source: You can find the rules for the tokens on the <a href="%(url_root)s/">contest overview page</a>.
fr: Vous pouvez trouver les règles sur l'utilisation des jetons sur la <a href="%(url_root)s/">page de présentation de l'épreuve</a>.

source: In addition to those rules, you can use at most one token every second on this task.
fr: En plus de ces règles, vous pouvez utiliser au plus un jeton chaque seconde sur cette tâche.

source: In addition to those rules, you can use at most one token every %(min_interval)d seconds on this task.
fr: En plus de ces règles, vous pouvez utiliser au plus un jeton toutes les %(min_interval)d secondes sur cette tâche.

source: Remeber that to see the detailed result of a submission you need to use both a contest-token and a task-token.
fr: Rappelez-vous que pour voir les résultats détaillés d'une soumission, vous avez besoin à la fois d'un jeton d'épreuve et d'un jeton de tâche.

source: You can find the rules for the contest-tokens on the <a href="%(url_root)s/">contest overview page</a>.
fr: Vous pouvez retrouver les règles des jetons d'épreuves sur la <a href="%(url_root)s/">page de présentation de l'épreuve</a>.

source: Attachments
fr: Pièces jointes

source: %(name)s (%(short_name)s) <small>submissions</small>
fr: %(name)s (%(short_name)s) <small>soumissions</small>

source: Submit a solution
fr: Soumettre une solution

source: Submit
fr: Soumettre

source: submission.zip
fr: soumission.zip

source: Previous submissions
fr: Soumissions précédentes

source: Right now, you have infinite tokens available on this task.
fr: Pour l'instant, vous avez un nombre infini de jetons pour cette tâche.

source: Right now, you have one token available on this task.
fr: Pour l'instant, vous avez un jeton disponible pour cette tâche.

source: Right now, you have %(tokens)s tokens available on this task.
fr: Pour l'instant, vous avez %(tokens)s jetons disponibles pour cette tâche.

source: But you have to wait until %(expiration_time)s to use them.
fr: Mais vous devez attendre jusqu'à %(expiration_time)s pour les utiliser.

source: You will receive a new token at %(gen_time)s.
fr: Vous recevrez un nouveau jeton à %(gen_time)s.

source: In the current situation, no more tokens will be generated.
fr: Aucun nouveau jeton n'est regénéré pour l'instant.

source: Right now, you do not have tokens available for this task.
fr: Pour l'instant, vous n'avez pas de jeton disponible pour cette tâche.

source: But you will have to wait until %(expiration_time)s to use it.
fr: Mais vous devrez attendre jusqu'à %(expiration_time)s pour l'utiliser.

source: Date and time
fr: Date et heure

source: Time
fr: Heure

source: Public score
fr: Score public

source: Total score
fr: Score total

source: Token
fr: Jeton

source: no submissions yet
fr: aucune soumission

source: Submission details
fr: Détails de la soumission

source: Close
fr: Fermer

source: Submit a test
fr: Soumettre un test

source: input
fr: entrée

source: Previous tests
fr: Tests précédents

source: Input
fr: Entrée

source: Output
fr: Sortie

source: no tests yet
fr: aucun test

source: Test details
fr: Détails du test

source: Evaluation outcome
fr: Résultat de l'évaluation

source: Executing...
fr: En cours d'exécution...

source: Executed
fr: Exécuté
